api_ver4/controllers/UserController.php

                    /* * ******************************* Bundle Data For Artist **************************** */

                    $modelSetting = new \backend\models\Setting();
                    $bundleData = $modelSetting->find()->where(array(
                        'ArtistID' => $artistID))->asArray()->all();
---
SELECT * FROM `setting` WHERE `ArtistID`=1

                    //Added by Daniele: append Instagram & Blog images from RSS feed: TEST
                    $companyID = 0; $companyName = "";
                    if($artistID > 0 && $ComID==0){
                        $artist = Artist::find()->where(['ArtistId' => $artistID])->one();

                        if($artist->CompanyID != null){
                            $companyID = $artist->CompanyID;
                            $company = Artist_company::find()->where(['Id' => $companyID])->one();
---
SELECT * FROM `artist` WHERE `ArtistId`='1'
SELECT * FROM `artist_company` WHERE `Id`=5

                    //$artist = Artist::find()->where(['ArtistId' => $artistID])->one();

                    /* try {
                         $artist = Artist::getDb()->cache(function ($db) use ($artistID) {
                             $artist = Artist::find()->where(['ArtistId' => $artistID])->one();
                             return $artist;
                         });
---
SELECT * FROM `artist` WHERE `ArtistId`='1' LIMIT 1